let f = [
    {
        "學校名稱": "大同大學",
        "系主任": "高有成",
        "系所名稱": "資訊經營系",
        "系所網址": "http://mis2.ttu.edu.tw/bin/home.php",
        "電話": "(02)21822928#6787",
        "地址": "104 台北市中山區中山北路三段40號"
    },
    {
        "學校名稱": "敏實科技大學",
        "系主任": "李培育",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.im.tust.edu.tw/",
        "電話": "(03)5927700#2751",
        "地址": "307 新竹縣芎林鄉大華路1號"
    },
    {
        "學校名稱": "大葉大學",
        "系主任": "林清同",
        "系所名稱": "資訊管理系",
        "系所網址": "https://im.dyu.edu.tw/",
        "電話": "(04)8511888#3131",
        "地址": "515 彰化縣大村鄉學府路168號"
    },
    {
        "學校名稱": "中山醫學大學(醫療產業科技管理學系)",
        "系主任": "邱政元",
        "系所名稱": "醫療資訊管理學系",
        "系所網址": "https://health.csmu.edu.tw/",
        "電話": "(04)24730022#11713",
        "地址": "40201 台中市南區建國北路一段110號"
    },
    {
        "學校名稱": "中州技術學院",
        "系主任": "廖基堯",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.ccut.edu.tw/adminSection/front/news.asp?site_id=im",
        "電話": "(04)8359000#3201",
        "地址": "510 彰化縣員林市山腳路三段2巷6號"
    },
    {
        "學校名稱": "中原大學",
        "系主任": "廖秀莉",
        "系所名稱": "資訊管理系",
        "系所網址": "https://im.cycu.edu.tw/",
        "電話": "(03)2655401 (大學)、(03)2655403(碩士、碩專)",
        "地址": "320 桃園市中壢區中北路200號"
    },
    {
        "學校名稱": "中國文化大學",
        "系主任": "杜淑芬",
        "系所名稱": "資訊管理系",
        "系所網址": "https://mis.pccu.edu.tw/bin/home.php",
        "電話": "(02)28610511、28611801#35906(資管系) 、#35905(資管所)",
        "地址": "台北市111陽明山華岡路55號"
    },
    {
        "學校名稱": "中國科技大學",
        "系主任": "羅勇夫",
        "系所名稱": "資訊管理系",
        "系所網址": "http://mis.cute.edu.tw/",
        "電話": "(02)29313416#2352(台北校區)；(03)6991111#1360(新竹校區)",
        "地址": "116 台北市文山區興隆路三段56號(台北校區)；303 新竹縣湖口鄉中山路三段530號(新竹校區)"
    },
    {
        "學校名稱": "中華大學",
        "系主任": "柯宇謙",
        "系所名稱": "資訊管理系",
        "系所網址": "http://mis.chu.edu.tw/",
        "電話": "(03)5374281#6524",
        "地址": "300 新竹市香山區五福路二段707號"
    },
    {
        "學校名稱": "中華科技大學",
        "系主任": "洪志評",
        "系所名稱": "資訊管理系",
        "系所網址": "http://im.cust.edu.tw/",
        "電話": "(02)26546420",
        "地址": "115 台北市南港區研究院路三段245號"
    },
    {
        "學校名稱": "中華醫事科技大學(數位設計與資訊管理系)",
        "系主任": "曾雅芬",
        "系所名稱": "資訊管理系",
        "系所網址": "https://ddim.hwai.edu.tw/index.php",
        "電話": "(06)2674567#550",
        "地址": "717 台南市仁德區文華一街89號"
    },
    {
        "學校名稱": "中臺科技大學",
        "系主任": "林宣宏",
        "系所名稱": "資訊管理系",
        "系所網址": "http://mgis2.ctust.edu.tw/bin/home.php",
        "電話": "(04)22391647#7701",
        "地址": "40601 台中市北屯區?子路666號"
    },
    {
        "學校名稱": "元培醫事科技大學",
        "系主任": "何順全",
        "系所名稱": "資訊管理系",
        "系所網址": "https://im.ypu.edu.tw/",
        "電話": "(03)6102361",
        "地址": "300 新竹市香山區元培街306號"
    },
    {
        "學校名稱": "元智大學",
        "系主任": "禹良治",
        "系所名稱": "資訊管理系",
        "系所網址": "https://www.mis.yzu.edu.tw/index.aspx?lang=cht",
        "電話": "(03)463-8800#2601",
        "地址": "320 桃園市中壢區遠東路135號"
    },
    {
        "學校名稱": "文藻外語大學(數位內容應用與管理系)",
        "系主任": "蘇彥衍",
        "系所名稱": "數位內容設計系",
        "系所網址": "https://c028.wzu.edu.tw/",
        "電話": "(07)3426031#6302、6303",
        "地址": "80793 高雄市三民區民族一路900號"
    },
    {
        "學校名稱": "世新大學",
        "系主任": "劉立民",
        "系所名稱": "資訊管理系",
        "系所網址": "http://im.wp.shu.edu.tw/",
        "電話": "(02)22368225#63360",
        "地址": "116 台北市文山區木柵路一段17巷1號"
    },
    {
        "學校名稱": "臺北城市科技大學",
        "系主任": "黃大炎",
        "系所名稱": "資訊管理系",
        "系所網址": "https://im.tpcu.edu.tw/bin/home.php",
        "電話": "(02)28927154#7701、7702",
        "地址": "112 台北市北投區學園路2號"
    },
    {
        "學校名稱": "國立臺北科技大學",
        "系主任": "陳育威",
        "系所名稱": "資訊與財金管理學系",
        "系所網址": "https://ifm.ntut.edu.tw/app/home.php",
        "電話": "(02)27712171#5900",
        "地址": "10608 台北市大安區忠孝東路三段1號"
    },
    {
        "學校名稱": "台南應用科技大學",
        "系主任": "劉育釧",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.mis.tut.edu.tw/",
        "電話": "(06)2532106#333、361",
        "地址": "710 台南市永康區中正路529號"
    },
    {
        "學校名稱": "台灣首府大學(資訊與多媒體設計學系)",
        "系主任": "楊振銘",
        "系所名稱": "資訊多媒體應用學系",
        "系所網址": "http://csmd.tsu.edu.tw/bin/home.php",
        "電話": "(06)5718888#861、862",
        "地址": "72153 台南市麻豆區168號"
    },
    {
        "學校名稱": "弘光科技大學",
        "系主任": "黃建基",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.csim.hk.edu.tw/main.php",
        "電話": "(04)26318652#5401~5403",
        "地址": "433 台中市沙鹿區台灣大道六段1018號"
    },
    {
        "學校名稱": "正修科技大學",
        "系主任": "夏自立",
        "系所名稱": "資訊管理系",
        "系所網址": "https://mis.csu.edu.tw/wSite/mp?mp=10204",
        "電話": "(07)7358800#5302、5303",
        "地址": "833 高雄市鳥松區澄清路840號"
    },
    {
        "學校名稱": "玄奘大學",
        "系主任": "蔡耀弘",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.hcu.edu.tw/itd/zh-tw/?sh=",
        "電話": "(03)5302255#5341",
        "地址": "300 新竹市香山區玄奘路48號"
    },
    {
        "學校名稱": "育達商業科技大學",
        "系主任": "張毓騰",
        "系所名稱": "資訊管理系",
        "系所網址": "https://www.im.ydu.edu.tw/",
        "電話": "(037)651188#5521、5522",
        "地址": "361 苗栗縣造橋鄉學府路168號"
    },
    {
        "學校名稱": "國立中央大學",
        "系主任": "蘇雅惠",
        "系所名稱": "資訊管理系",
        "系所網址": "https://im.mgt.ncu.edu.tw/",
        "電話": "(03)4227151#66500、66501、66536、66559",
        "地址": "320 桃園市中壢區中大路300號"
    },
    {
        "學校名稱": "東海大學",
        "系主任": "陳澤雄",
        "系所名稱": "資訊管理系",
        "系所網址": "http://im.thu.edu.tw/",
        "電話": "(04)23590121#35900",
        "地址": "407224 台中市西屯區台灣大道四段1727號"
    },
    {
        "學校名稱": "國立中央警察大學",
        "系主任": "廖有祿",
        "系所名稱": "資訊管理系",
        "系所網址": "https://im.cpu.edu.tw/bin/home.php",
        "電話": "(03)3282321",
        "地址": "333 桃園市龜山區樹人路56號"
    },
    {
        "學校名稱": "國立台北大學",
        "系主任": "江義平",
        "系所名稱": "資訊管理所",
        "系所網址": "http://www.mis.ntpu.edu.tw/#/",
        "電話": "(02)86741111#66894",
        "地址": "237 新北市三峽區大學路151號"
    },
    {
        "學校名稱": "國立台灣大學",
        "系主任": "陳建錦",
        "系所名稱": "資訊管理系",
        "系所網址": "https://management.ntu.edu.tw/IM",
        "電話": "(02)33663366",
        "地址": "10617 台北市大安區羅斯福路四段1號"
    },
    {
        "學校名稱": "國立交通大學",
        "系主任": "蔡銘箴",
        "系所名稱": "資訊管理所",
        "系所網址": "https://www.iim.nctu.edu.tw/zh",
        "電話": "(03)5712121#57401",
        "地址": "30010 新竹市東區大學路1001號"
    },
    {
        "學校名稱": "國立交通大學(資訊管理與財務金融學系)",
        "系主任": "梁婉麗",
        "系所名稱": "資訊與財金管理學系",
        "系所網址": "https://imf.nctu.edu.tw/",
        "電話": "(03)5712121#57051",
        "地址": "30010 新竹市東區大學路1001號"
    },
    {
        "學校名稱": "國立東華大學",
        "系主任": "侯佳利",
        "系所名稱": "資訊管理系",
        "系所網址": "https://im.ndhu.edu.tw/bin/home.php",
        "電話": "(03)8903000#3102",
        "地址": "974 花蓮縣壽豐鄉大學路二段1號"
    },
    {
        "學校名稱": "國立空中大學(管理與資訊學系)",
        "系主任": "林俊裕",
        "系所名稱": "資訊管理系",
        "系所網址": "https://mi.nou.edu.tw/",
        "電話": "(02)22829355#7655",
        "地址": "247 新北市蘆洲區中正路172號"
    },
    {
        "學校名稱": "國立政治大學",
        "系主任": "洪為璽",
        "系所名稱": "資訊管理系",
        "系所網址": "https://mis2.nccu.edu.tw/",
        "電話": "(02)29393091#89055~89057、 63681",
        "地址": "116 台北市文山區指南路二段64號"
    },
    {
        "學校名稱": "國立國防大學",
        "系主任": "蘇品長",
        "系所名稱": "資訊管理系",
        "系所網址": "http://im.ndmc.ndu.edu.tw/",
        "電話": "(03)3801120",
        "地址": "112 台北市北投區中央北路二段70號"
    },
    {
        "學校名稱": "國立臺北護理健康大學",
        "系主任": "徐建業",
        "系所名稱": "資訊管理系",
        "系所網址": "http://im.ntunhs.edu.tw/",
        "電話": "(02)28227101#3919",
        "地址": "112 台北市北投區明德路365號"
    },
    {
        "學校名稱": "東吳大學",
        "系主任": "鄭為民",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.csim.scu.edu.tw/",
        "電話": "(02)23111531",
        "地址": "100 台北市中正區貴陽街一段56號"
    },
    {
        "學校名稱": "長庚大學",
        "系主任": "廖耕億",
        "系所名稱": "資訊管理系",
        "系所網址": "https://im.cgu.edu.tw/",
        "電話": "(03)2118800#5812",
        "地址": "333 桃園市龜山區文化一路259號"
    },
    {
        "學校名稱": "真理大學",
        "系主任": "黃啟誠",
        "系所名稱": "資訊管理系",
        "系所網址": "https://mis.au.edu.tw/index.php?Lang=zh-tw",
        "電話": "(02)26212121#6301、6302",
        "地址": "251 新北市淡水區真理街32號"
    },
    {
        "學校名稱": "淡江大學",
        "系主任": "魏世杰",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.im.tku.edu.tw/tw/",
        "電話": "(02)26215656#2645、2648",
        "地址": "251 新北市淡水區英專路151號"
    },
    {
        "學校名稱": "華梵大學",
        "系主任": "嚴建和",
        "系所名稱": "資訊管理系",
        "系所網址": "http://mis.hfu.edu.tw/main.php",
        "電話": "(02)26632102#4351",
        "地址": "223 新北市石碇區華梵路1號"
    },
    {
        "學校名稱": "開南大學",
        "系主任": "許榮隆",
        "系所名稱": "資訊管理系",
        "系所網址": "https://im.knu.edu.tw/",
        "電話": "(03)3412500#3503",
        "地址": "338 桃園市蘆竹區開南路1號"
    },
    {
        "學校名稱": "實踐大學",
        "系主任": "鄭王駿",
        "系所名稱": "資訊科技與管理學系",
        "系所網址": "https://itm.usc.edu.tw/",
        "電話": "(02)25381111#8811、8813",
        "地址": "10462 台北市中山區大直街70號"
    },
    {
        "學校名稱": "輔仁大學",
        "系主任": "蔡明志",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.im.fju.edu.tw/site/",
        "電話": "(02)29052000",
        "地址": "242 新北市新莊區中正路510號"
    },
    {
        "學校名稱": "銘傳大學",
        "系主任": "李永山",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.im.mcu.edu.tw/main.php",
        "電話": "(03)3507001#3318、3528",
        "地址": "333 桃園市龜山區德明路5號"
    },
    {
        "學校名稱": "國立中興大學",
        "系主任": "林詠章",
        "系所名稱": "資訊管理系",
        "系所網址": "http://mis.nchu.edu.tw/",
        "電話": "(04)22840864",
        "地址": "402 台中市南區興大路145號"
    },
    {
        "學校名稱": "國立彰化師範大學",
        "系主任": "施穎偉",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.im.ncue.edu.tw/",
        "電話": "(04)7232105#7605、7606",
        "地址": "500 彰化縣彰化市師大路2號"
    },
    {
        "學校名稱": "國立暨南國際大學",
        "系主任": "戴榮賦",
        "系所名稱": "資訊管理系",
        "系所網址": "https://www.im.ncnu.edu.tw/",
        "電話": "(049)2910960#4541~4545",
        "地址": "54561 南投縣埔里鎮大學路1號"
    },
    {
        "學校名稱": "國立聯合大學",
        "系主任": "黃貞芬",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.im.nuu.edu.tw/",
        "電話": "(037)381501",
        "地址": "36003 苗栗縣苗栗市聯大1號"
    },
    {
        "學校名稱": "亞洲大學(行動商務與多媒體應用學系)",
        "系主任": "廖岳祥",
        "系所名稱": "資訊多媒體應用學系",
        "系所網址": "https://mcma.asia.edu.tw/",
        "電話": "(04)23323456#6122",
        "地址": "41354 台中市霧峰區柳豐路500號"
    },
    {
        "學校名稱": "明道大學(資訊傳播學系)",
        "系主任": "張冀青",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.dic.mdu.edu.tw/",
        "電話": "(04)8876660#8111",
        "地址": "523 彰化縣埤頭鄉文化路369號"
    },
    {
        "學校名稱": "靜宜大學",
        "系主任": "莊育維",
        "系所名稱": "資訊管理系",
        "系所網址": "https://csim.pu.edu.tw/",
        "電話": "(04)26328001#18011~18013",
        "地址": "433 台中市沙鹿區台灣大道七段200號"
    },
    {
        "學校名稱": "國立中山大學",
        "系主任": "林芬慧",
        "系所名稱": "資訊管理系",
        "系所網址": "https://web.mis.nsysu.edu.tw/",
        "電話": "(07)5252000#4701",
        "地址": "804 高雄市鼓山區蓮海路70號"
    },
    {
        "學校名稱": "國立中正大學",
        "系主任": "阮金聲",
        "系所名稱": "資訊管理系",
        "系所網址": "https://www.mis.ccu.edu.tw/",
        "電話": "(05)2720411",
        "地址": "62102 嘉義縣民雄鄉大學路一段168號"
    },
    {
        "學校名稱": "國立台東大學",
        "系主任": "陳宜檉",
        "系所名稱": "資訊管理系",
        "系所網址": "https://isms.nttu.edu.tw/",
        "電話": "(089)517636",
        "地址": "950 台東縣台東市大學路二段369號"
    },
    {
        "學校名稱": "國立成功大學(工業與資訊管理學系)",
        "系主任": "翁慈宗",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.iim.ncku.edu.tw/",
        "電話": "(06)2757575#53100",
        "地址": "701 台南市東區大學路1號"
    },
    {
        "學校名稱": "中華民國海軍軍官學校",
        "系主任": "龔榮源",
        "系所名稱": "資訊管理系",
        "系所網址": "NA",
        "電話": "(07)5850347",
        "地址": "811 高雄市左營區軍校路669號"
    },
    {
        "學校名稱": "國立高雄大學",
        "系主任": "丁一賢",
        "系所名稱": "資訊管理系",
        "系所網址": "https://im.nuk.edu.tw/",
        "電話": "(07)5919326",
        "地址": "811 高雄市楠梓區高雄大學路700號"
    },
    {
        "學校名稱": "國立嘉義大學",
        "系主任": "董和昇",
        "系所名稱": "資訊管理系",
        "系所網址": "https://www.ncyu.edu.tw/mis/",
        "電話": "(05)2732892",
        "地址": "600 嘉義市西區新民路580號"
    },
    {
        "學校名稱": "國立臺南大學",
        "系主任": "林豪鏘",
        "系所名稱": "數位學習科技學系",
        "系所網址": "http://ilt.nutn.edu.tw/",
        "電話": "(06)2133111#771",
        "地址": "70005 台南市中西區樹林街二段33號"
    },
    {
        "學校名稱": "長榮大學",
        "系主任": "柯志鴻",
        "系所名稱": "資訊管理系",
        "系所網址": "http://dweb.cjcu.edu.tw/im?lang=zh-TW",
        "電話": "(06)2785123#6051",
        "地址": "711 台南市歸仁區長大路1號"
    },
    {
        "學校名稱": "南華大學",
        "系主任": "陳信良",
        "系所名稱": "資訊管理系",
        "系所網址": "http://im3.nhu.edu.tw/",
        "電話": "?(05)2721001#2611",
        "地址": "622 嘉義縣大林鎮南華路一段55號"
    },
    {
        "學校名稱": "義守大學",
        "系主任": "吳傳春",
        "系所名稱": "資訊管理系",
        "系所網址": "https://www.isu.edu.tw/2018/homepage_v01.php?dept_mno=652",
        "電話": "(07)6577711",
        "地址": "840 高雄市大樹區學城路一段1號"
    },
    {
        "學校名稱": "國立台中科技大學",
        "系主任": "范敏玄",
        "系所名稱": "資訊管理系",
        "系所網址": "https://im.nutc.edu.tw/bin/home.php",
        "電話": "(04)22196310",
        "地址": "404 台中市北區三民路三段129號"
    },
    {
        "學校名稱": "亞東技術學院",
        "系主任": "洪維強",
        "系所名稱": "資訊管理系",
        "系所網址": "https://mi.oit.edu.tw/index.php",
        "電話": "(02)77388000",
        "地址": "220 新北市板橋區四川路二段58號"
    },
    {
        "學校名稱": "南亞技術學院",
        "系主任": "董炳信",
        "系所名稱": "資訊管理系",
        "系所網址": "http://im.nanya.edu.tw/",
        "電話": "(03)4361070",
        "地址": "320 桃園市中壢區中山東路三段414號"
    },
    {
        "學校名稱": "致理科技大學",
        "系主任": "呂崇富",
        "系所名稱": "資訊管理系",
        "系所網址": "https://im100.chihlee.edu.tw/",
        "電話": "(02)22576167#1313",
        "地址": "220 新北市板橋區文化路一段313號"
    },
    {
        "學校名稱": "華夏科技大學",
        "系主任": "許莉莆",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.mis.hwh.edu.tw/bin/home.php",
        "電話": "(02)89415100#4102",
        "地址": "235 新北市中和區工專路111號"
    },
    {
        "學校名稱": "黎明技術學院",
        "系主任": "陳林宏",
        "系所名稱": "資訊管理系",
        "系所網址": "http://192.192.75.66/mis/",
        "電話": "(02)29097811#2101",
        "地址": "243 新北市泰山區泰林路三段22號"
    },
    {
        "學校名稱": "醒吾科技大學",
        "系主任": "陳慶忠",
        "系所名稱": "資訊管理系",
        "系所網址": "https://mis.hwu.edu.tw/",
        "電話": "(02)26015310#2460~2463",
        "地址": "244 新北市林口區粉寮路一段101號"
    },
    {
        "學校名稱": "蘭陽技術學院",
        "系主任": "黃素珍",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www2.fit.edu.tw/department/cont?did=17",
        "電話": "(03)9771997",
        "地址": "261 宜蘭縣頭城鎮復興路79號"
    },
    {
        "學校名稱": "國立勤益科技大學",
        "系主任": "張定原",
        "系所名稱": "資訊管理系",
        "系所網址": "http://mis.web2.ncut.edu.tw/bin/home.php",
        "電話": "(04)23924505#7911、7912",
        "地址": "41170 台中市太平區中山路二段57號"
    },
    {
        "學校名稱": "和春技術學院",
        "系主任": "NA",
        "系所名稱": "資訊管理系",
        "系所網址": "http://commerce.fotech.edu.tw/files/11-1005-252.php?Lang=zh-tw",
        "電話": "(07)2621941",
        "地址": "831 高雄市大寮區至學路288號"
    },
    {
        "學校名稱": "國立台灣科技大學",
        "系主任": "羅乃維",
        "系所名稱": "資訊管理系",
        "系所網址": "https://www.cs.ntust.edu.tw/index.php/zh/",
        "電話": "(02)27333141#7901",
        "地址": "106 台北市大安區基隆路四段43號"
    },
    {
        "學校名稱": "明新科技大學",
        "系主任": "葉慈章",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.im.must.edu.tw/",
        "電話": "(03)5593142#3431~3433",
        "地址": "304 新竹縣新豐鄉新興路1號"
    },
    {
        "學校名稱": "健行科技大學",
        "系主任": "林孟文",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.im.uch.edu.tw/",
        "電話": "(03)4581196#7301",
        "地址": "320 桃園市中壢區健行路229號"
    },
    {
        "學校名稱": "景文科技大學(行動商務與多媒體應用系)",
        "系主任": "方鎮良",
        "系所名稱": "資訊管理系",
        "系所網址": "http://mm.just.edu.tw/home/",
        "電話": "(02)82122000#2300、2335",
        "地址": "231 新北市新店區安忠路99號"
    },
    {
        "學校名稱": "聖約翰科技大學",
        "系主任": "詹景旭",
        "系所名稱": "資訊管理系",
        "系所網址": "https://sites.google.com/mail.sju.edu.tw/mis",
        "電話": "(02)28013131#6802",
        "地址": "251 新北市淡水區淡金路四段499號"
    },
    {
        "學校名稱": "萬能科技大學",
        "系主任": "施伯勳",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.im.vnu.edu.tw/",
        "電話": "(03)4515811#66000",
        "地址": "320 桃園市中壢區萬能路1號"
    },
    {
        "學校名稱": "德明財經科技大學",
        "系主任": "劉崑義?",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.mis.takming.edu.tw/cht/indexmis.asp",
        "電話": "(02)26585801#2761",
        "地址": "114 台北市內湖區環山路一段56號"
    },
    {
        "學校名稱": "龍華科技大學",
        "系主任": "尤昌筧",
        "系所名稱": "資訊管理系",
        "系所網址": "https://im.lhu.edu.tw/",
        "電話": "02-82093211#6301",
        "地址": "333 桃園市龜山區萬壽路一段300號"
    },
    {
        "學校名稱": "南開科技大學",
        "系主任": "李孟度",
        "系所名稱": "資訊管理系",
        "系所網址": "http://nkmis.nkut.edu.tw/main.php",
        "電話": "(049)2563489#2862",
        "地址": "542 南投縣草屯鎮中正路568號"
    },
    {
        "學校名稱": "建國科技大學",
        "系主任": "黃士哲",
        "系所名稱": "資訊管理系",
        "系所網址": "https://im.ctu.edu.tw/",
        "電話": "(04)7111111#3600~3602",
        "地址": "500 彰化縣彰化市介壽北路1號"
    },
    {
        "學校名稱": "修平科技大學",
        "系主任": "王仁澤",
        "系所名稱": "資訊管理系",
        "系所網址": "https://im.hust.edu.tw/",
        "電話": "(04)23692136",
        "地址": "412 台中市大里區工業路11號"
    },
    {
        "學校名稱": "朝陽科技大學",
        "系主任": "呂慈純",
        "系所名稱": "資訊管理系",
        "系所網址": "https://webim.cyut.edu.tw/",
        "電話": "(04)23323000#7124",
        "地址": "413310 台中市霧峰區吉峰東路168號"
    },
    {
        "學校名稱": "僑光科技大學",
        "系主任": "程榮祥",
        "系所名稱": "資訊管理系",
        "系所網址": "https://imtech.ocu.edu.tw/",
        "電話": "(04)27016855",
        "地址": "407 台中市西屯區僑光路100號"
    },
    {
        "學校名稱": "嶺東科技大學",
        "系主任": "黃國華",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.teach.ltu.edu.tw/Home/Index?gpid=30",
        "電話": "(04)23892088#3732",
        "地址": "408 台中市南屯區嶺東路1號"
    },
    {
        "學校名稱": "國立雲林科技大學",
        "系主任": "莊煥銘",
        "系所名稱": "資訊管理系",
        "系所網址": "https://www.mis.yuntech.edu.tw/",
        "電話": "(05)5342601#5302~5304",
        "地址": "64002 雲林縣斗六市大學路三段123號"
    },
    {
        "學校名稱": "國立虎尾科技大學",
        "系主任": "吳純慧",
        "系所名稱": "資訊管理系",
        "系所網址": "http://nfuim.nfu.edu.tw/zh/",
        "電話": "(05)6315000",
        "地址": "632 雲林縣虎尾鎮文化路64號"
    },
    {
        "學校名稱": "國立屏東大學",
        "系主任": "戴逸民",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.mis.nptu.edu.tw/bin/home.php?Lang=zh-tw",
        "電話": "(08)7663800",
        "地址": "900 屏東縣屏東市民生東路51號"
    },
    {
        "學校名稱": "國立高雄科技大學",
        "系主任": "蘇國瑋",
        "系所名稱": "資訊管理系",
        "系所網址": "https://mis.nkust.edu.tw/app/index.php",
        "電話": "(07)6011000#34102",
        "地址": "824 高雄市燕巢區大學路1號"
    },
    {
        "學校名稱": "國立澎湖科技大學",
        "系主任": "林永清",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.mis.npu.edu.tw/",
        "電話": "(06)9264115#3402",
        "地址": "880 澎湖縣馬公市六合路300號"
    },
    {
        "學校名稱": "南台科技大學",
        "系主任": "汪美香",
        "系所名稱": "資訊管理系",
        "系所網址": "https://mis.stust.edu.tw/",
        "電話": "(06)2533131#4301",
        "地址": "71005 台南市永康區南台街1號"
    },
    {
        "學校名稱": "美和科技大學",
        "系主任": "苑梅俊",
        "系所名稱": "資訊管理系",
        "系所網址": "http://dim.meiho.edu.tw/",
        "電話": "(08)7799821#8661",
        "地址": "912 屏東縣內埔鄉屏光路23號"
    },
    {
        "學校名稱": "高苑科技大學",
        "系主任": "史浩文",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.mis.kyu.edu.tw/",
        "電話": "(07)6077090",
        "地址": "82146 高雄市路竹區中山路1821號"
    },
    {
        "學校名稱": "崑山科技大學",
        "系主任": "曾生元",
        "系所名稱": "資訊管理系",
        "系所網址": "https://web.ksu.edu.tw/DTMAIMD/bulletin/",
        "電話": "(06)2727175",
        "地址": "710 台南市永康區崑大路195號"
    },
    {
        "學校名稱": "嘉南藥理科技大學",
        "系主任": "陳瑞甫",
        "系所名稱": "資訊管理系",
        "系所網址": "https://mis.cnu.edu.tw/",
        "電話": "(06)2664911#5300",
        "地址": "71710 台南市仁德區二仁路一段60號"
    },
    {
        "學校名稱": "輔英科技大學",
        "系主任": "葉富豪",
        "系所名稱": "資訊科技與管理學系",
        "系所網址": "http://eitm.fy.edu.tw/?Lang=zh-tw",
        "電話": "(07)7811151#6480",
        "地址": "831 高雄市大寮區進學路151號"
    },
    {
        "學校名稱": "遠東科技大學",
        "系主任": "何瑞峰",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.feu.edu.tw/edu/mis/101new/index.asp",
        "電話": "(06)5979566",
        "地址": "744 台南市新市區中華路49號???"
    },
    {
        "學校名稱": "樹德科技大學",
        "系主任": "蔡旭昇",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.mis.stu.edu.tw/",
        "電話": "(07)6158000#3002",
        "地址": "824 高雄市燕巢區橫山路59號"
    },
    {
        "學校名稱": "環球科技大學(資訊與電子商務管理系)",
        "系主任": "盧盈光",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.iecm.twu.edu.tw/showindex.php",
        "電話": "(05)5370988#4351",
        "地址": "640 雲林縣斗六市鎮南路1221號"
    },
    {
        "學校名稱": "康寧大學(健康數位科技學系)",
        "系主任": "陳國偉",
        "系所名稱": "資訊管理系",
        "系所網址": "http://da.ukn.edu.tw/bin/home.php",
        "電話": "(06)2552500#33300",
        "地址": "709 台南市安南區安中路五段188號"
    },
    {
        "學校名稱": "樹人醫護管理專校",
        "系主任": "楊媚靜",
        "系所名稱": "資訊管理系",
        "系所網址": "http://www.szmc.edu.tw/Information/",
        "電話": "?(07)6979392",
        "地址": "821 高雄市路竹區環球路452號"
    }
];

let table6 = document.getElementById('myTable6');
for (let item of f) {
        let row = table6.insertRow();
        for (let key in item) {
                let cell = row.insertCell();
                cell.textContent = item[key];
                cell.style.color = "white"; // Set text color to white
        }
}
